Revit 2027 API
AnalysisDisplayDiagramSettings.OutlineLineWeight Property
 Line weight of outline and fence lines in the diagram.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int OutlineLineWeight { get; set; }
Public Property OutlineLineWeight As Integer
	Get
	Set
public:
property int OutlineLineWeight {
	int get ();
	void set (int value);
}
member OutlineLineWeight : int with get, set
Property Value
Int32
See Also
Reference
AnalysisDisplayDiagramSettings Class
Autodesk.Revit.DB.Analysis Namespace